Revit 2024 API
UnitTypeId.Kilonewtons Property
 Kilonewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Kilonewtons { get; }
Visual Basic
Public Shared ReadOnly Property Kilonewtons As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Kilonewtons {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace